codeigniter4/app/Models/NewsModel.php

SELECT *
FROM `news`
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `news`
---
        $orderDirection = strtolower($orderDirection) === 'desc' ? 'desc' : 'asc';

        $builder->orderBy($orderBy, $orderDirection);
        return $builder->paginate($perPage);